In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame( {'A' :['A0','A1','A2','A3'],
                     'B' :['B0','B1','B2','B3'],
                     'C' :['C0','C1','C2','C3'],
                     'D' :['D0','D1','D2','D3']},
                       index=[0,1,2,3]  # 행 인덱스  
                  )
df2 = pd.DataFrame( {'A' :['A4','A5','A6','A7'],
                     'B' :['B4','B5','B6','B7'],
                     'C' :['C4','C5','C6','C7'],
                     'D' :['D4','D5','D6','D7']},
                       index=[4,5,6,7]    # 행 인덱스 
                  )
df3 = pd.DataFrame( {'A' :['A8','A9','A10','A11'],
                     'B' :['B8','B9','B10','B11'],
                     'C' :['C8','C9','C10','C11'],
                     'D' :['D8','D9','D10','D11']},
                       index=[8,9,6,11]   # 행 인덱스 
                  )

In [3]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [4]:
df2.iloc[0:2] #위치 기반(0~)

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5

In [5]:
df2.loc[4:5] # 행 인덱스

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5

In [6]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [7]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
6   A10  B10  C10  D10
11  A11  B11  C11  D11

#### ○ concat 함수

In [8]:
result = pd.concat([df1,df2,df3])  # 아무옵션이 없으면 열방향으로 합쳐짐 
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
6   A10  B10  C10  D10
11  A11  B11  C11  D11

In [9]:
df4 = pd.DataFrame( {'B' :['B22','B33','B6','B7'],
                     'D' :['D8','D9','D10','D11'],
                     'F' :['C8','C9','C10','C11']},
                       index=[2,3,6,7]   
                  )

In [10]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [11]:
result = pd.concat([df1,df4] , axis=1) 
#행방향으로 합쳐짐  행인덱스가 같은 것끼리
# 행인덱스 같은 것이 없어도 모두 합해짐
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2  B22   D8   C8
3   A3   B3   C3   D3  B33   D9   C9
6  NaN  NaN  NaN  NaN   B6  D10  C10
7  NaN  NaN  NaN  NaN   B7  D11  C11

In [12]:
# inner join.  (행 인덱스가 같은 것끼리 조인)
result = pd.concat([df1,df4],axis=1, join='inner') 
# axis=1 행방향으로 합쳐짐 
# 행인덱스 같은 것이 없으면 제외. 
result

    A   B   C   D    B   D   F
2  A2  B2  C2  D2  B22  D8  C8
3  A3  B3  C3  D3  B33  D9  C9

#### ○ merge 함수

In [13]:
left = pd.DataFrame( {'key' :['K0','K4','K2','K3'],
                     'A' :['A0','A1','A2','A3'],
                     'B' :['B0','B1','B2','B3']} 
                  )
right = pd.DataFrame( {'key' :['K0','K1','K2','K3'],
                     'C' :['C0','C1','C2','C3'],
                     'D' :['D0','D1','D2','D3']} 
                  )

In [14]:
left

  key   A   B
0  K0  A0  B0
1  K4  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [15]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

#### pd.merge(left, right,  on='key') 
key 컬럼 값이 일치하는 행끼리 합쳐짐

In [16]:
pd.merge(left, right, on='key')  # 아래와 동일  how='inner' 가 default 
pd.merge(left, right, how='inner',on='key') 
left

  key   A   B
0  K0  A0  B0
1  K4  A1  B1
2  K2  A2  B2
3  K3  A3  B3

#### pd.merge(left, right, how='left', on='key') 
왼쪽을 기준으로 key 컬럼 값이 일치하는 행끼리 합쳐짐

In [17]:
pd.merge(left, right, how='left',on='key')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K4  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

#### pd.merge(left, right, how='right', on='key')
오른쪽을 기준으로 key 컬럼 값이 일치하는 행끼리 합쳐짐

In [18]:
pd.merge(left, right, how='right' ,on='key')

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1  NaN  NaN  C1  D1
2  K2   A2   B2  C2  D2
3  K3   A3   B3  C3  D3

#### pd.merge(left, right, how='outer', on='key')
key 컬럼 값이 일치하는 행끼리 합쳐지고, 일치하지 않는 컬럼도 모두 나타남.

In [19]:
pd.merge(left, right, how='outer', on='key')

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K4   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K1  NaN  NaN   C1   D1